note/2018/blog-in-org-mode-revisited/index.org
#+SETUPFILE: ../../setup.org
#+TITLE: Blog in Org Mode, Revisited
#+DATE: <2018-11-16 Fri>

# TODO report to org mode to add (eval) to macro doc

I have an [[../blog-with-only-org-mode/index.html][earlier post]] about the same subject.
Since then, a lot of things have changed, so I decide to revisit the topic and talk about
my improved work flow.
This post is a super set of the earlier one, so there is no need to check that out.

The source file of my blog at the time writing can be found [[https://github.com/casouri/casouri.github.io/tree/a709fe637823ea317bd127569220e945c5abfdc5/note][here]].

* Why No Frameworks?
Personally, I don't like those static site generates, e.g. Hexo, Pelican, Hugo, Jekyll.
Each one of them requires you to learn the framework and set it up correctly.
It feels like too much work and complexity for a simple static site.

On the other hand, when directly exporting HTML files from Org files,
you have the full control of the whole process. And customizing is often trivial.

I'll demonstrate how I build my blog with Org Mode and CSS,
and let you decide whether to do the same.

* Style
I want my blog to be in the old school style like 90's hypertext pages.
Some example includes [[https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html][Emacs Lisp Reference Manual]], [[https://www.w3.org/Provider/Style/][Style Guide for online hypertext]], [[https://web.stanford.edu/class/cs166/][CS166 of Stanford]].
The simplicity, elegance and plain coolness (what's that?) really attract me, and I hope you, too.

Don't get me wrong, modern web pages like [[https://www.apple.com][apple.com]] are beautiful, too.
But they are complicated and hard to maintain.
I don't feel like spending all the time to make a beautiful animated site
while the time could be used to generate better contents.
Plus I prefer the "old style" anyway.

* Specific Implementation
** File Structure
The file structure of my blog, root directory is https://archive.casouri.co.uk/note/

- =index.org=: the Org file for the [[../../index.html][index page]]
- =index.html=: the exported [[../../index.html][index page]]
- =setup.org=: my setup file (kind of like template) for Org Mode export
- =style.css=: the style sheet for all the pages
- =script.js=: the script file for all the pages. Currently I don't have anything in there.
- year(e.g. 2918)
  - post: each post is in a separate directory
    - =index.org=: the Org file
    - =index.html=: the exported HTML file
    - other static files used in the page

** Links
Because I want my site to work both online and on disk (that is, you can download the site to disk
and view it the same), I use relative links everywhere.

One inconvenience is that I can't use link that points to a directory anymore: say =./2018/mypost/=.
Instead, I need to explicitly write out the file: =./2018/mypost/index.html=.
This looks a little bit dangerous, but should be OK.

For internal links, just use the headline name of the headline you want to reference as the link.
So
#+HTML: <code>[[Template (Sorf of)][Headline below me]]</code>
will point to the headline below.

** Template (Sort of)
This is my template:

#+BEGIN_SRC org
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../style.css"/>
#+HTML_HEAD_EXTRA: <script type="text/javascript" src="../../script.js"></script>
#+HTML_HEAD_EXTRA: <link rel="icon" type="image/png" href="../../../favicon.png">
#+HTML_LINK_UP: ../../index.html
#+HTML_LINK_HOME: ../../index.html
#+OPTIONS: toc:2
#+END_SRC

It is called setup file in Org Mode.
In =index.org= file of each post, there is a line =#+SETUPFILE: ../../setup.org=.
When Org exports the file, it first loads the setup file (=setup.org=),
and environment set by that file will be used when exporting the post.
You can think of it as adding these lines to every Org file before exporting.

The purpose of each line:

#+BEGIN_SRC org
#+OPTIONS: html-style:nil
#+END_SRC

ꜛ disable the default styling that Org HTML exporter uses. I style my blog in my own CSS file.

#+BEGIN_SRC org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../style.css"/>
#+END_SRC

ꜛ Link to my style sheet.

#+BEGIN_SRC org
#+HTML_HEAD_EXTRA: <script type="text/javascript" src="../../script.js"></script>
#+END_SRC

ꜛ Link to my script file.

#+BEGIN_SRC org
#+HTML_HEAD_EXTRA: <link rel="icon" type="image/png" href="../../../favicon.png">
#+END_SRC

ꜛ Link to my favicon.

#+BEGIN_SRC org
#+HTML_LINK_UP: ../../index.html
#+HTML_LINK_HOME: ../../index.html
#+END_SRC

ꜛ Add UP and HOME link to head line. [[Head Line][See more below]].

#+BEGIN_SRC org
#+OPTIONS: toc:2
#+END_SRC

ꜛ Collect down to the second level header for TOC.

