note/2018/blog-in-org-mode-revisited/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-16 Fri 19:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blog in Org Mode, Revisited</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Blog in Org Mode, Revisited</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5a6a7b7">1. Why No Frameworks?</a></li>
<li><a href="#org8b8de47">2. Style</a></li>
<li><a href="#org94448bc">3. Specific Implementation</a>
<ul>
<li><a href="#orga3377d6">3.1. File Structure</a></li>
<li><a href="#org99192c8">3.2. Links</a></li>
<li><a href="#orga221100">3.3. Template (Sort of)</a></li>
<li><a href="#org72539b8">3.4. TOC</a></li>
<li><a href="#orga96e9e5">3.5. Head Line</a></li>
<li><a href="#org4469d57">3.6. RSS</a></li>
<li><a href="#orgddc0f4a">3.7. Other CSS Tricks</a></li>
<li><a href="#org8d1624b">3.8. Misc</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I have an <a href="../blog-with-only-org-mode/index.html">earlier post</a> about the same subject.
Since then, a lot of things changed, so I decide to revisit the topic and talk about
my improved work flow.
This post is a super set of the earlier one, so there is no need to check that out.
</p>

<div id="outline-container-org5a6a7b7" class="outline-2">
<h2 id="org5a6a7b7"><span class="section-number-2">1</span> Why No Frameworks?</h2>
<div class="outline-text-2" id="text-1">
<p>
Personally, I don't like those static site generates, e.g. Hexo, Pelican, Hugo, Jekyll.
Each one of them requires you to learn the framework and set it up correctly.
It feels like too much work and complexity for a simple static site.
</p>

<p>
On the other hand, when directly exporting HTML files from Org files,
you have the full control of the whole process. And customizing is often trivial.
</p>

<p>
I'll demonstrate how I build my blog with Org Mode and CSS,
and let you decide whether to do the same.
</p>
</div>
</div>

<div id="outline-container-org8b8de47" class="outline-2">
<h2 id="org8b8de47"><span class="section-number-2">2</span> Style</h2>
<div class="outline-text-2" id="text-2">
<p>
I want my blog to be in the old school style like 90's hypertext pages.
Some example includes <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html">Emacs Lisp Reference Manual</a>, <a href="https://www.w3.org/Provider/Style/">Style Guide for online hypertext</a>, <a href="https://web.stanford.edu/class/cs166/">CS166 of Stanford</a>.
The simplicity, elegance and plain coolness (what's that?) really attract me, and I hope you, too.
</p>

<p>
Don't get me wrong, modern web pages like <a href="https://www.apple.com">apple.com</a> are beautiful, too.
But they are complicated and hard to maintain.
I don't feel like spending all the time to make a beautiful animated site
while the time could be used to generate better contents.
Plus I prefer the "old style" anyway.
</p>
</div>
</div>

<div id="outline-container-org94448bc" class="outline-2">
<h2 id="org94448bc"><span class="section-number-2">3</span> Specific Implementation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga3377d6" class="outline-3">
<h3 id="orga3377d6"><span class="section-number-3">3.1</span> File Structure</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The file structure of my blog, root directory is <a href="https://archive.casouri.co.uk/note/">https://archive.casouri.co.uk/note/</a>
</p>

<ul class="org-ul">
<li><code>index.org</code>: the Org file for the index page</li>
<li><code>index.html</code>: the exported index page</li>
<li><code>setup.org</code>: my setup file (kind of like template) for Org Mode export</li>
<li><code>style.css</code>: the style sheet for all the pages</li>
<li><code>script.js</code>: the script file for all the pages. Currently I don't have anything in there.</li>
<li>year(e.g. 2918)
<ul class="org-ul">
<li>post: each post is in a separate directory
<ul class="org-ul">
<li><code>index.org</code>: the Org file</li>
<li><code>index.html</code>: the exported HTML file</li>
<li>other static files used in the page</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org99192c8" class="outline-3">
<h3 id="org99192c8"><span class="section-number-3">3.2</span> Links</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Because I want my site to work both online and on disk (that is, you can download the site to disk
as view it the same), I use relative links everywhere.
</p>

<p>
One inconvenience is that I can't use link that points to a directory anymore: say <code>./2018/mypost/</code>.
Instead, I need to explicitly write out the file: <code>./2018/mypost/index.html</code>.
This looks a little bit dangerous, but should be OK.
</p>

<p>
For internal links, just use the headline name of the headline you want to reference as the link.
So
</p>
<code>[[TempLate (Sorf of)][Headline below me]]</code>
<p>
will point to the headline below.
</p>
</div>
</div>

<div id="outline-container-orga221100" class="outline-3">
<h3 id="orga221100"><span class="section-number-3">3.3</span> Template (Sort of)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This is my template:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+OPTIONS: html-style:nil</span>
<span style="color: #84888b;">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="../../style.css"/&gt;</span>
<span style="color: #84888b;">#+HTML_HEAD_EXTRA: &lt;script type="text/javascript" src="../../script.js"&gt;&lt;/script&gt;</span>
<span style="color: #84888b;">#+HTML_HEAD_EXTRA: &lt;link rel="icon" type="image/png" href="../../../favicon.png"&gt;</span>
<span style="color: #84888b;">#+HTML_LINK_UP: ../../index.html</span>
<span style="color: #84888b;">#+HTML_LINK_HOME: ../../index.html</span>
<span style="color: #84888b;">#+OPTIONS: toc:2</span>
</pre>
</div>

<p>
It is basically a template.
In <code>index.org</code> file of each post, there is a line <code>#+SETUPFILE: ../../setup.org</code>.
When Org exports the file, it first loads the setup file (<code>setup.org</code>),
and environment set by that file will be used when exporting the post.
You can think of it as adding these lines to every Org file before exporting.
</p>

<p>
The purpose of each line:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+OPTIONS: html-style:nil</span>
</pre>
</div>

<p>
ꜛ disable the default styling that Org HTML exporter uses. I style my blog in my own CSS file.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="../../style.css"/&gt;</span>
</pre>
</div>

<p>
ꜛ Link to my style sheet.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+HTML_HEAD_EXTRA: &lt;script type="text/javascript" src="../../script.js"&gt;&lt;/script&gt;</span>
</pre>
</div>

<p>
ꜛ Link to my script file.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+HTML_HEAD_EXTRA: &lt;link rel="icon" type="image/png" href="../../../favicon.png"&gt;</span>
</pre>
</div>

<p>
ꜛ Link to my favicon.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+HTML_LINK_UP: ../../index.html</span>
<span style="color: #84888b;">#+HTML_LINK_HOME: ../../index.html</span>
</pre>
</div>

<p>
ꜛ Add UP and HOME link to head line. <a href="#orga96e9e5">See more below</a>.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+OPTIONS: toc:2</span>
</pre>
</div>

<p>
ꜛ Collect down to the second level headline for TOC.
</p>
</div>
</div>
