note/2018/blog-in-org-mode-revisited/index.org
** TOC
On narrow screens, the table of content will simply be on top of the body.
On wider screens, I made it to float on the right.
If you are reading this post on a PC, you can probably see it.

It is achieved by this CSS snippet:

#+BEGIN_SRC css
@media screen and (min-width: 800px) {
    /* floating TOC */
    #table-of-contents  {
        font-size: 12pt;
        bottom:0;
        position:fixed;
        overflow-y:scroll;
        overflow-x:hidden;
        top: 5%;
        right: 2%;
        width: 20%;
    }
    /* centered content */
    body {
        margin-left: 10%;
        margin-right: 30%;
        /* this way floating TOC wouldn't touch content */
        width: 58%;
    }
}
#+END_SRC

You can see that on wider screens, the content only occupies 60% (actually 58%) of the width of the screen.

For the TOC, =overflow-y:scroll;= makes TOC scroll able in case TOC is height is larger than the screen height.

** Head Line
The head line is the strip on the very top of each page.
Specifically the line =UP | HOME= on posts and =UP | HOME               RSS | Source | License=
on the [[../../index.html][index page]].

The normal behavior of it is =UP | HOME=.
Org HTML exporter adds this head line when you have
#+BEGIN_SRC org
#+HTML_LINK_UP: path-up-a-level
#+HTML_LINK_HOME: path-to-home
#+END_SRC
in your setup.
As you have already seen, I have these configured in my setup file.

For the [[../../index.html][index page]], however, I hacked it a little bit.
In =index.org= of the [[../../index.html][index page]], I have this snippet in the end of the file:

#+BEGIN_SRC emacs-lisp
# Local Variables:
# org-html-home/up-format: "<div id=\"org-div-home-and-up-index-page\"> <div> <a accesskey=\"h\" href=\"%s\"> UP </a> | <a accesskey=\"H\" href=\"%s\"> HOME </a> </div> <div> <a href=\"./index.xml\"> RSS </a> | <a href=\"https://github.com/casouri/casouri.github.io\"> Source </a> | <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\"> License </a> </div> </div>"
# End:
#+END_SRC

That is a [[https://www.gnu.org/software/emacs/manual/html_node/emacs/File-Variables.html][file local variable]], it sets =org-html-home/up-format= to

#+BEGIN_SRC html
<div id="org-div-home-and-up-index-page">
  <div>
    <a accesskey="h" href="../home/index.html"> UP </a>
    |
    <a accesskey="H" href="../home/index.html"> HOME </a>
  </div>
  <div>
    <a href="./index.xml"> RSS </a>
    |
    <a href="https://github.com/casouri/casouri.github.io"> Source </a>
    |
    <a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
  </div>
</div>
#+END_SRC

and in effect, injects =RSS | Source | License= part into the format.

To make the two part align with either side,
I set the style of =org-div-home-and-up-index-page= as

#+BEGIN_SRC css
div#org-div-home-and-up-index-page {
    /* headline */
    display: flex;
    justify-content: space-between;
}
#+END_SRC

See [[https://css-tricks.com/snippets/css/a-guide-to-flexbox/][here]] for more on CSS flex box.

** RSS

RSS feed is an essential part of a blog.
However, Org Mode doesn't make it easy to add one for my blog.

Some references that helped me along the way:

- [[https://www.brautaset.org/articles/2018/org-mode-rss.html][Creating an RSS feed with Org mode]]
- [[https://orgmode.org/worg/dev/org-export-reference.html][Org Export Reference Documentation]]
- [[https://validator.w3.org/feed/docs/rss2.html][RSS 2.0 SPECIFICATION]]
- [[https://orgmode.org/manual/Macro-replacement.html][Macro replacement]]

I use a modified [[https://code.orgmode.org/bzg/org-mode/src/master/contrib/lisp/ox-rss.el][ox-rss.el]] to generate RSS file.
As its name suggests, it is a contrib package for Org Mode,
so you need to download it first.

