note/2018/blog-in-org-mode-revisited/index.html

<div id="outline-container-org72539b8" class="outline-3">
<h3 id="org72539b8"><span class="section-number-3">3.4</span> TOC</h3>
<div class="outline-text-3" id="text-3-4">
<p>
On narrow screens, the table of content will simply be on top of the body.
On wider screens, I made it to float on the right.
If you are reading this post on a PC, you can probably see it.
</p>

<p>
It is achieved by this CSS snippet:
</p>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #a626a4;">@media</span> screen and <span style="color: #4078f2;">(</span>min-width: 800px<span style="color: #4078f2;">)</span> <span style="color: #4078f2;">{</span>
    <span style="color: #9ca0a4;">/* </span><span style="color: #9ca0a4;">floating TOC </span><span style="color: #9ca0a4;">*/</span>
    <span style="color: #4078f2;">#table-of-contents  </span><span style="color: #a626a4;">{</span>
        <span style="color: #50a14f;">font-size</span>: 12pt;
        <span style="color: #50a14f;">bottom</span>:0;
        <span style="color: #50a14f;">position</span>:fixed;
        <span style="color: #50a14f;">overflow-y</span>:scroll;
        <span style="color: #50a14f;">overflow-x</span>:hidden;
        <span style="color: #50a14f;">top</span>: 5%;
        <span style="color: #50a14f;">right</span>: 2%;
        <span style="color: #50a14f;">width</span>: 20%;
    <span style="color: #a626a4;">}</span>
    <span style="color: #9ca0a4;">/* </span><span style="color: #9ca0a4;">centered content </span><span style="color: #9ca0a4;">*/</span>
    <span style="color: #4078f2;">body </span><span style="color: #a626a4;">{</span>
        <span style="color: #50a14f;">margin-left</span>: 10%;
        <span style="color: #50a14f;">margin-right</span>: 30%;
        <span style="color: #9ca0a4;">/* </span><span style="color: #9ca0a4;">this way floating TOC wouldn't touch content </span><span style="color: #9ca0a4;">*/</span>
        <span style="color: #50a14f;">width</span>: 58%;
    <span style="color: #a626a4;">}</span>
<span style="color: #4078f2;">}</span>
</pre>
</div>

<p>
You can see that on wider screens, the content only occupies 60% (actually 58%) of the width of the screen.
</p>

<p>
For the TOC, <code>overflow-y:scroll;</code> makes TOC scroll able in case TOC is height is larger than the screen height.
</p>
</div>
</div>

<div id="outline-container-orga96e9e5" class="outline-3">
<h3 id="orga96e9e5"><span class="section-number-3">3.5</span> Head Line</h3>
<div class="outline-text-3" id="text-3-5">
<p>
The head line is the strip on the very top of each page.
Specifically the line <code>UP | HOME</code> on posts and <code>UP | HOME               RSS | Source | License</code>
on the index page.
</p>

<p>
The normal behavior of it is <code>UP | HOME</code>.
Org HTML exporter add this head line when you have
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #84888b;">#+HTML_LINK_UP: path-up-a-level</span>
<span style="color: #84888b;">#+HTML_LINK_HOME: path-to-home</span>
</pre>
</div>
<p>
in your setup.
</p>

<p>
As you have already seen, I have these configured in my setup file.
</p>

<p>
For the index page, however, I hacked it a little bit.
In <code>index.org</code> of the index page, I have this snippet in the end of the file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"># Local Variables&#58;
# org-html-home/up-format: <span style="color: #50a14f;">"&lt;div id=\"org-div-home-and-up-index-page\"&gt; &lt;div&gt; &lt;a accesskey=\"h\" href=\"%s\"&gt; UP &lt;/a&gt; | &lt;a accesskey=\"H\" href=\"%s\"&gt; HOME &lt;/a&gt; &lt;/div&gt; &lt;div&gt; &lt;a href=\"./index.xml\"&gt; RSS &lt;/a&gt; | &lt;a href=\"https://github.com/casouri/casouri.github.io\"&gt; Source &lt;/a&gt; | &lt;a href=\"https://creativecommons.org/licenses/by-sa/4.0/\"&gt; License &lt;/a&gt; &lt;/div&gt; &lt;/div&gt;"</span>
# End:
</pre>
</div>

<p>
That is a <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/File-Variables.html">file local variable</a>, it sets <code>org-html-home/up-format</code> to
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #a626a4;">div</span> <span style="color: #6a1868;">id</span>=<span style="color: #50a14f;">"org-div-home-and-up-index-page"</span>&gt;
  &lt;<span style="color: #a626a4;">div</span>&gt;
    &lt;<span style="color: #a626a4;">a</span> <span style="color: #6a1868;">accesskey</span>=<span style="color: #50a14f;">"h"</span> <span style="color: #6a1868;">href</span>=<span style="color: #50a14f;">"../home/index.html"</span>&gt; UP &lt;/<span style="color: #a626a4;">a</span>&gt;
    |
    &lt;<span style="color: #a626a4;">a</span> <span style="color: #6a1868;">accesskey</span>=<span style="color: #50a14f;">"H"</span> <span style="color: #6a1868;">href</span>=<span style="color: #50a14f;">"../home/index.html"</span>&gt; HOME &lt;/<span style="color: #a626a4;">a</span>&gt;
  &lt;/<span style="color: #a626a4;">div</span>&gt;
  &lt;<span style="color: #a626a4;">div</span>&gt;
    &lt;<span style="color: #a626a4;">a</span> <span style="color: #6a1868;">href</span>=<span style="color: #50a14f;">"./index.xml"</span>&gt; RSS &lt;/<span style="color: #a626a4;">a</span>&gt;
    |
    &lt;<span style="color: #a626a4;">a</span> <span style="color: #6a1868;">href</span>=<span style="color: #50a14f;">"https://github.com/casouri/casouri.github.io"</span>&gt; Source &lt;/<span style="color: #a626a4;">a</span>&gt;
    |
    &lt;<span style="color: #a626a4;">a</span> <span style="color: #6a1868;">href</span>=<span style="color: #50a14f;">"https://creativecommons.org/licenses/by-sa/4.0/"</span>&gt; License &lt;/<span style="color: #a626a4;">a</span>&gt;
  &lt;/<span style="color: #a626a4;">div</span>&gt;
&lt;/<span style="color: #a626a4;">div</span>&gt;
</pre>
</div>

<p>
and in effect, injects <code>RSS | Source | License</code> part into the format.
</p>

<p>
To make the two part align with either side,
I set the style of <code>org-div-home-and-up-index-page</code> as
</p>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #4078f2;">div#org-div-home-and-up-index-page </span><span style="color: #4078f2;">{</span>
    <span style="color: #9ca0a4;">/* </span><span style="color: #9ca0a4;">headline </span><span style="color: #9ca0a4;">*/</span>
    <span style="color: #50a14f;">display</span>: flex;
    <span style="color: #50a14f;">justify-content</span>: space-between;
<span style="color: #4078f2;">}</span>
</pre>
</div>

<p>
See <a href="https://css-tricks.com/snippets/css/a-guide-to-flexbox/">here</a> for more on CSS flex box.
</p>
</div>
</div>

<div id="outline-container-org4469d57" class="outline-3">
<h3 id="org4469d57"><span class="section-number-3">3.6</span> RSS</h3>
<div class="outline-text-3" id="text-3-6">
<p>
RSS feed is an essential part of a blog.
However, Org Mode doesn't make it easy to add one for my blog.
</p>

<p>
Some references that helped me along the way:
</p>

<ul class="org-ul">
<li><a href="https://www.brautaset.org/articles/2018/org-mode-rss.html">Creating an RSS feed with Org mode</a></li>
<li><a href="https://orgmode.org/worg/dev/org-export-reference.html">Org Export Reference Documentation</a></li>
<li><a href="https://validator.w3.org/feed/docs/rss2.html">RSS 2.0 SPECIFICATION</a></li>
<li><a href="https://orgmode.org/manual/Macro-replacement.html">Macro replacement</a></li>
</ul>

<p>
I use a modified <a href="https://code.orgmode.org/bzg/org-mode/src/master/contrib/lisp/ox-rss.el">ox-rss.el</a> to generate RSS file.
As its name suggests, it is a contrib package for Org Mode,
so you need to download it first.
</p>
</div>
